app/controllers/skins_controller.rb

  def update
    @skins = Skin.find(params[:id])

    if @skins.update(skins_params)
---
UPDATE "skins" SET "updated_at" = ? WHERE "skins"."id" = ?  [["updated_at", "2022-09-18 11:00:59.828064"], ["id", 1]]

  def create
    @skins = Skin.new(skins_params)
    @skins.user = current_user
    if @skins.save
---
INSERT INTO "skins" ("name", "description", "photo", "Standart", "Taiko", "Mania", "CatchTheBeat", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def show
    @skins = Skin.find(params[:id])
---
SELECT "skins".* FROM "skins" WHERE "skins"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def index
    @skins = Skin.all
---
SELECT "skins".* FROM "skins"

  def destroy
    @skins = Skin.find(params[:id])
    @skins.destroy
---
SELECT "skins".* FROM "skins" WHERE "skins"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "skins" WHERE "skins"."id" = ?  [["id", 1]]